/*
Navicat MySQL Data Transfer

Source Server         : 本机
Source Server Version : 50553
Source Host           : localhost:3306
Source Database       : search

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2020-03-30 14:09:35
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for item
-- ----------------------------
DROP TABLE IF EXISTS `item`;
CREATE TABLE `item` (
  `id` bigint(20) NOT NULL COMMENT '商品id',
  `type` varchar(20) DEFAULT NULL COMMENT '分类',
  `title` varchar(100) DEFAULT NULL COMMENT '商品标题',
  `sell_point` varchar(100) DEFAULT NULL COMMENT '商品卖点',
  `price` decimal(10,2) DEFAULT '0.00' COMMENT '商品价格',
  `num` int(11) DEFAULT NULL COMMENT '库存数量',
  `status` int(1) DEFAULT '1' COMMENT '商品状态 1正常 0下架',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_time` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `status` (`status`),
  KEY `updated` (`update_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='商品表';

-- ----------------------------
-- Records of item
-- ----------------------------
INSERT INTO `item` VALUES ('1', '配件', '坚果 Pro 软胶保护套', 'TPU 环保材质、耐磨、耐油、耐久性强', '49.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('2', '配件', '坚果 Pro 钢化玻璃保护膜（前屏用）', '高达 92% 的超强透光率、耐刮花、防指纹', '49.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('3', '配件', 'Smartisan 原装快充充电器 18W', '18W 安全快充、支持主流 QC3.0, MTK PE+2.0 快充协议', '59.00', '999', '1', '2017-09-05 21:27:54', '2017-11-09 22:31:04');
INSERT INTO `item` VALUES ('4', '配件', 'Smartisan 坚果自拍杆', '通用 3.5 mm 接口、航空铝合金伸缩杆、防过敏硅胶手柄', '69.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('5', '配件', 'Smartisan 快充移动电源 10000mAh', '10000mAh 双向快充、轻盈便携、高标准安全保护', '199.00', '999', '1', '2017-09-05 21:27:54', '2017-11-09 22:22:53');
INSERT INTO `item` VALUES ('6', '配件', 'Smartisan 原装 Type-C 数据线', 'PTC 过温保护、凹形设计、TPE 环保材质', '39.00', '999', '1', '2017-09-05 21:27:54', '2017-10-22 22:15:02');
INSERT INTO `item` VALUES ('7', '耳机', 'Smartisan S-100 半入耳式线控耳机', '卓越的 14.2mm 发音单元、三按键式线控', '99.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('8', '电视', '极米无屏电视 CC', '720P 高清分辨率、JBL 音响、两万毫安续航力', '2799.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('9', '手机', '小米 小米手机 小米20', '小米最新旗舰手机，小米20，谁用谁知道', '2999.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('10', '平板', '小米 小米平板 小米平板5', '小米新平板，高清屏幕，秒杀Ipad', '3999.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('11', '耳机', 'FIIL CARAT 蓝牙运动耳机', '智能计步、磁吸项链式、佩戴舒适不易掉', '499.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('12', '耳机', 'FIIL CARAT LITE 蓝牙运动耳机', '线控带麦、IP65 防水、磁吸项链式', '299.00', '999', '1', '2017-09-05 21:27:54', '2017-09-05 21:29:54');
INSERT INTO `item` VALUES ('13', '耳机', 'FIIL Diva Pro 全场景无线降噪耳机', '智能语音交互、高清无损本地存储播放', '1499.00', '999', '1', '2017-09-05 21:27:54', '2018-04-20 22:18:11');
INSERT INTO `item` VALUES ('14', '手机', '三星 Galaxy S4 (I9500) 16G版 星空黑 联通3G手机', '年货特价来袭！三星经典旗舰机！', '1888.00', '999', '1', '2017-09-05 21:27:54', '2017-11-06 23:44:32');
INSERT INTO `item` VALUES ('15', '手机', '苹果 IPhone X 全面屏 全面绽放', '苹果手机，你不来一款嘛？', '10222.00', '999', '1', '2017-09-05 21:27:54', '2018-07-13 21:59:05');
INSERT INTO `item` VALUES ('16', '电视', '小米 小米电视 小米电视5', '小米电视5，3mm厚度，4K屏幕，让你在家享受影院观影', '9999.00', '999', '1', '2017-09-05 21:27:54', '2018-07-13 21:38:52');
INSERT INTO `item` VALUES ('17', '衣服', 'Smartisan T恤 伍迪·艾伦出生', '一件内外兼修的舒适T恤', '149.00', '999', '1', '2018-04-18 20:41:41', '2018-04-20 00:21:01');
INSERT INTO `item` VALUES ('18', '配件', '坚果 3 前屏钢化玻璃保护膜', '超强透光率、耐刮花、防指纹', '49.00', '999', '1', '2018-04-19 00:34:06', '2018-04-19 23:49:38');
INSERT INTO `item` VALUES ('19', '配件', '坚果 3 绒布国旗保护套', '质感精良、完美贴合、周到防护', '79.00', '999', '1', '2018-04-19 00:35:50', '2018-04-20 00:01:08');
INSERT INTO `item` VALUES ('20', '配件', '坚果 3 TPU 软胶透明保护套', '轻薄透明、完美贴合、TPU 环保材质', '29.00', '999', '1', '2018-04-19 00:38:07', '2018-04-20 00:02:54');
INSERT INTO `item` VALUES ('21', '耳机', 'Smartisan 半入耳式耳机', '经典配色、专业调音、高品质麦克风', '89.00', '999', '1', '2018-04-19 00:40:40', '2018-04-20 00:04:41');
INSERT INTO `item` VALUES ('22', '配件', '坚果 3 TPU 软胶保护套', 'TPU 环保材质、完美贴合、周到防护', '49.00', '999', '1', '2018-04-19 00:43:48', '2018-04-20 00:06:58');
INSERT INTO `item` VALUES ('23', '配件', '坚果 3 \"足迹\"背贴 乐高创始人出生', '1891 年 4 月 7 日', '79.00', '999', '1', '2018-04-19 00:45:14', '2018-04-20 00:08:21');
INSERT INTO `item` VALUES ('24', '手机', '坚果 3', '漂亮得不像实力派', '1999.00', '999', '1', '2018-04-19 22:13:31', '2018-07-13 22:03:52');
INSERT INTO `item` VALUES ('25', '其他', '畅呼吸智能空气净化器超级除甲醛版', '购新空净 赠价值 699 元活性炭滤芯', '2999.00', '999', '1', '2018-04-19 22:16:05', '2018-07-13 22:06:58');
INSERT INTO `item` VALUES ('26', '衣服', 'Smartisan 帆布鞋', '一双踏实、舒适的帆布鞋', '199.00', '999', '1', '2018-04-19 22:22:02', '2018-04-20 00:19:39');
INSERT INTO `item` VALUES ('27', '衣服', 'Smartisan T恤 任天堂发售“红白机”', '100% 美国 SUPIMA 棉、舒适拉绒质地', '149.00', '999', '1', '2018-04-19 22:23:39', '2018-04-20 00:23:09');
INSERT INTO `item` VALUES ('28', '衣服', 'Smartisan Polo衫 经典款', '一件表里如一的舒适 POLO 衫', '249.00', '999', '1', '2018-04-19 22:25:41', '2018-04-20 10:51:53');
INSERT INTO `item` VALUES ('29', '衣服', 'Smartisan 牛津纺衬衫', '一件无拘无束的舒适衬衫', '199.00', '999', '1', '2018-04-19 22:28:11', '2018-04-20 10:53:15');
INSERT INTO `item` VALUES ('30', '衣服', 'Smartisan 明信片', '优质卡纸、包装精致、色彩饱满', '9.90', '999', '1', '2018-04-19 22:31:09', '2018-04-21 11:26:31');
INSERT INTO `item` VALUES ('31', '耳机', 'ACIL E1 颈挂式蓝牙耳机', '无感佩戴，一切变得简单', '199.00', '999', '1', '2018-04-19 22:32:38', '2018-04-20 11:17:31');
INSERT INTO `item` VALUES ('32', '其他', '优点智能 E1 推拉式智能指纹密码锁', '推拉一下，轻松开关', '2699.00', '999', '1', '2018-04-19 22:36:50', '2018-04-20 00:13:44');
INSERT INTO `item` VALUES ('33', '耳机', 'FIIL Driifter 脖挂蓝牙耳机', '全天佩戴 抬手就听 HEAC稳连技术', '499.00', '999', '1', '2018-06-02 19:43:12', '2018-06-02 19:43:14');
